public class Main {
    public static void main(String[] args) {

//        Cat goldie = new Cat("Рыжик", 15);
//        goldie.meow();
//
//        Cat busya = new Cat("Буся", 1);
//        busya.meow();

        Human maxim = new Human("Максим", "Минск", 1988, "бренд-менеджера");
        Human anya = new Human("Аня", "Москва", 1993, "методиста образовательных программ");
        Human katya = new Human("Катя", "Калининград", 1992, "продакт-менеджера");
        Human artem = new Human("Артём", "Москва", 1995, "директора по развитию бизнеса");
        System.out.println(maxim);
        System.out.println(anya);
        System.out.println(katya);
        System.out.println(artem);


// Task_1

// Создайте объекты для следующих персон:
//    Максим из города Минск, который родился в 1988 году;
//    Аня из города Москва, которая родилась в 1993 году;
//    Катя из города Калининград, которая родилась в 1992 году;;
//    Артем из города Москва, который родился в 1995 году.

// Task_2

//    Добавьте в поле класса «Человек» новое свойство — «Должность» (jobTitle).
//    Допишите программу таким образом, чтобы в консоль выводилось приветственное сообщение в формате:
//    "Привет! Меня зовут… Я из города… Я родился в… году. Я работаю на должности… . Будем знакомы!"

    }

}